Repository: dlastes/edt
Catalog: FlOpEDT/locale/*/LC_MESSAGES/djangojs.po
Languages: fr

source: The schedule shall be fully regenerated (see downside to the right).
fr: L'emploi du temps va être regénéré totalement (cf. en bas à droite).

source: Just update your availabilities : they will be considered for the next generation.
fr: Contentez-vous de mettre à jour vos disponibilités : elles seront prises en compte lors de la regénération.

source: Courses :
fr: Cours :

source: Avail :
fr: Dispos :

source: Validate timetable
fr: Valider EDT

source: Validate availabilities
fr: Valider les disponibilités

source: Apply
fr: Appliquer

source: tipical week
fr: semaine type

source: Teacher
fr: Prof

source: Group
fr: Groupe

source: Definitely cancel
fr: Annuler définitivement

source: Put on hold
fr: Mettre en attente

source: Move to week
fr: Déplacer en semaine

source: by
fr: par

source: Confirm
fr: Valider

source: No checked box, no moved course!
fr: Aucune case cochée, aucun cours déplacé

source: You want these courses to have no tutor, right?
fr: Vous voulez que ces cours n'aient pas de prof, c'est bien ça?

source: Then please assign these courses to someone.
fr: Dans ce cas assignez ces cours à une personne.

source: Chose the action you want to do.
fr: Choisissez l'action que vous voulez faire.

source: not scheduled
fr: pas placé

source: Schedule manager <span id="flopGreen">fl</span>exible and <span id="flopGreen">op</span>enSource
fr: Gestionnaire d'emplois du temps <span id="flopGreen">fl</span>exible et <span id="flopGreen">op</span>enSource

source: "Who want to manage schedules this year?" ... ... <span id="flopGreen">flop</span>!
fr: Qui veut gérer les emplois du temps cette année ? ... ... <span id="flopGreen">flop</span> !

source: And your schedules will <span id="flopRedDel">flop</span> be a hit!
fr: Et votre emploi du temps fera un <span id="flopRedDel">flop</span> carton !

source: Even your logo will be on time...
fr: Et même votre logo sera à l'heure...

source: You got to make the schedules? Don't flip out: <span id="flopGreen">flop</span> it!
fr: C'est à vous de gérer les <span id="flopRed">EDT</span>? Ne flippez pas : <span id="flopGreen">flop</span>ez!

source: To flop or not to flop, that is the question (for your schedules)
fr: To flop or not to flop, telle est la question (pour tes EDT)

source: flop!Scheduler != flop
fr: flop!EDT != flop

source: Schedule... khhh... I am your flop!
fr: EDT... khhh... I am your flop!

source: Successful operation
fr: Opération réussie

source: It's a fail.
fr: C'est un échec.

source: Room
fr: Salle

source: Number of days
fr: Nombre de jours

source: You have to do
fr: Vous devez faire

source: No course for you this week.
fr: Vous n'intervenez pas cette semaine.

source: You propose
fr: Vous en proposez

source: Maybe you should free up more...
fr: Il faudrait peut-être en rajouter...

source: It's Ok.
fr: C'est parfait

source: Thank you for adding some.
fr: Merci d'en ajouter

source: No planned re-generation
fr: Pas de regénération prévue

source: Full (minor) generation planned on
fr: Regénération totale (mineure) le

source: Full generation planned (probably on
fr: Regénération totale prévue (probablement le

source: Minor generation planned (probably on
fr: Regénération mineure prévue (probablement le

source: Modify
fr: Modifier

source: Filters
fr: Filtres

source: Employees
fr: Salarié·e·s

source: Posts
fr: Postes

source: Groups
fr: Groupes

source: Teachers
fr: Profs

source: Rooms
fr: Salles

source: KO
fr: C'est un échec cuisant. Trouvez un·e responsable de flop!EDT et faites lui part de vos problèmes.

source: OK
fr: La modification s'est déroulée sans accroc.

source: What to change ?
fr: Que changer ?

source: Module teacher ?
fr: Enseignant⋅e du module ?

source: Alphabetical order
fr: Ordre alphabétique

source: Virtual classroom link ?
fr: Lien de la classe en visioconférence ?

source: Relating to who ?
fr: Relatif à qui ?

source: No room available
fr: Pas de salle disponible

source: Room available
fr: Salle disponible

source: Rooms available
fr: Salles disponibles

source: No room available (any type)
fr: Aucune salle disponible (tous types)

source: Room available (any type)
fr: Salle disponible (tous types)

source: Rooms available (any type)
fr: Salles disponibles (tous types)

source: No room
fr: Pas de salle

source: Every rooms
fr: Toutes les salles

source: Who should do it ?
fr: Qui s'y colle ?

source: You will erase ALL COURSES corresponding to the following conditions. Do you confirm import ?
fr: Vous allez effacer TOUS LES COURS correspondant aux conditions suivantes. Confirmez-vous l'import ?

source: From week
fr: De la semaine

source: year
fr: année

source: until week
fr: à la semaine

source: Department :
fr: Département :

source: Periods :
fr: Périodes :

source: Weeks :
fr: Semaines :

source: All
fr: Toutes

source: time2
fr: Temps2

source: nb_max
fr: Nombre max

source: weekdays
fr: Jours de semaine

source: nb_min
fr: Nombre min

source: join2courses
fr: Joindre les cours

source: slot_start_time
fr: Heure de début

source: curfew_time
fr: Heure de couvre-feu

source: weeks
fr: Semaines

source: slot_end_time
fr: Heure de fin

source: max_number
fr: Nombre max

source: max_holes_per_day
fr: Trous max par jour

source: train_progs
fr: Promotions

source: max_holes_per_week
fr: Trous max par semaine

source: limit
fr: Limite

source: min_time_per_period
fr: Temps minimum par période

source: max_time_per_period
fr: Temps maximum par période

source: course_type
fr: Type de cours

source: max_hours
fr: Heures max

source: fhd_period
fr: Période

source: tolerated_margin
fr: Marge tolérée

source: number_of_weeks
fr: Nombre de semaines

source: guide_tutors
fr: Accompagnatrice·eur

source: min_days_nb
fr: Nombre min de jours

source: lower_bound_hours
fr: Limite inférieure d'heures

source: work_copy
fr: Numéro de copie

source: fixed_days
fr: Jours fixés

source: tutor
fr: Enseignant·e

source: group
fr: Groupe

source: possible_rooms
fr: Salles possibles

source: start_lunch_time
fr: Heure de début

source: end_lunch_time
fr: Heure de fin

source: fampm_period
fr: Période

source: weekday
fr: Jour de la semaine

source: lunch_length
fr: Durée de la pause

source: min_break_length
fr: Durée min de la pause

source: tutor_status
fr: Statut de l'enseignant·e

source: course_types
fr: Types de cours

source: possible_week_days
fr: Jours de la semaine possibles

source: groups
fr: Groupes

source: tutors
fr: Enseignant·e·s

source: possible_start_times
fr: Heures de début possibles

source: forbidden_week_days
fr: Jours de la semaine interdits

source: forbidden_start_times
fr: Heures de début interdites

source: pre_assigned_only
fr: Uniquement les cours pré-affectés

source: percentage
fr: Pourcentage

source: time1
fr: Heure1

source: AM
fr: Matin

source: PM
fr: Après-midi

source: fd
fr: Journée

source: hd
fr: Demie-journée

source: m
fr: Lundi

source: tu
fr: Mardi

source: w
fr: Mercredi

source: th
fr: Jeudi

source: f
fr: Vendredi

source: sa
fr: Samedi

source: su
fr: Sunday

source: All changes have been saved.
fr: Tous les changements ont été enregistrés.

source: All groups
fr: Tous les groupes

source: Strong constraint
fr: Contrainte forte

source: Weight :
fr: Poids :

source: Select all
fr: Tout sélectionner

source: Remove all
fr: Tout enlever

source: Cancel
fr: Annuler

source: Required
fr: Requis

source: Guide tutor
fr: Accompagnateur·ice

source: Tutor
fr: Prof

source: Strong constraints
fr: Contraintes fortes

source: Preferences
fr: Préférences

source: All constraints
fr: Toutes les contraintes

source: Edit
fr: Modifier

source: Delete
fr: Supprimer

source: Duplicate
fr: Dupliquer

source: All tutors
fr: Tous les profs

source: Start early in order to end up early
fr: Commencer tôt pour finir tôt

source: Do not start late, so as not to end up too late
fr: Ne pas commencer tard, pour ne pas finir tard

source: Indifferent
fr: Indifférent

source: Do not start early, even if I don't end up early
fr: Ne pas commencer tôt, même si je dois ne pas finir tôt

source: Start late, even if I end up late
fr: Commencer tard, même si je finis tard

source: Have light days
fr: Des journées allégées

source: Have light days more than free half-days
fr: Des journées allégées plutôt que des demies-journées libres

source: Have free half-days more than light days.
fr: Des demie-journées libres plutôt que des journées allégées

source: Have free half-days.
fr: Des demies-journées libres

source: Avoid holes between courses
fr: Eviter les trous entre les cours

source: Promote holes between courses
fr: Favoriser les trous entre les cours

source: Eat early
fr: Manger tôt

source: Eat late
fr: Manger tard
